import React from "react";
import { Accordion } from "../components/accordion/accordion";

interface IAccordionData {
	accordionData: {
		title: string;
		content: string;
	}[];
}

const accordionData = [
	{
		title: "Почему именно этот курс?",
		content: `Курс на самом деле уникален. Он довольно непростой. В нем не будет монотонной начитки стандартных вещей которые можно найти в интернете. Так же не будет классической отрисовки UI-kit’a который будет подан как дизайн-система. В курсе вложен весь мой многолетний опыт работы с дизайн системами, практические выжимки задач и решений с которыми мне приходилось сталкиваться каждый день.
                Здесь мы не будем много рисовать но, будем много анализировать для того, чтобы понимать как правильно подходить к задаче и решать ее. Будем писать код, чтобы понимать и видеть мир дизайн систем глазами разработчика. Посмотрим на процесс сотрудником, которому нужно продать её важность в компании и, подумаем о дизайнере, который использует её каждый день. Также мы научимся разговаривать с разработкой на одном языке, не идти на поводу у технологий и понимать ограничения для того, чтобы грамотно строить и синхронизировать компоненты из дизайна в код`,
	},
	{
		title: "Я новичок в дизайн системах, смогу потянуть?",
		content: `Буду честен, для абсолютных новичков, без опыта во фронте либо в использовании или создании дизайн библиотек это будет очень сложно но, если есть желание превозмочь себя и пересмотреть лекции N раз чтобы вкачаться то, добро пожаловать на борт`,
	},

	{
		title: "Что я получу по итогу?",
		content: `Настоящий трухард. Прочувствуете на себе работу по выстраиванию дизайн-системы на всех её этапах. Посмотрите на неё со стороны Дизайна, Разработки, Бизнеса. Разовьете не только хардовые ни и софтовые навыки так как в курсе есть своя изюминка которую я закладывал при его создании. Будет довольно сложно но, оно того стоит, поверьте.`,
	},
];

export const FaqSection: React.FC<IAccordionData> = ({ accordionData }) => {
	return (
		<section className="container display-flex flex-column gap-32 flex-align-center">
			<h2 className="centered">Часто задаваемые вопросы</h2>
			{accordionData &&
				accordionData.map(({ title, content }) => (
					<Accordion title={title} content={content} key={title} />
				))}
		</section>
	);
};
