import { CardClient } from "../components/tesimonials/card";

export const Testimonials = () => {
	return (
		<div className="display-flex flex-column gap-24 flex-align-center">
			<h2>Выпускники говорят сами за себя</h2>
			<div className="display-flex gap-24">
				<CardClient
					className="flex-grow"
					img="/client-1.png"
					name="Полина"
					role="Senior UX/UI Designer, Design System"
					company="Home Credit Bank"
					content="Очень много ценных материалов, приёмов и подходов получаешь за достаточно короткий срок.
Чувствуется, что Артуру самому важно, чтобы ученики не просто ушли с курса с какой-то информацией, а положили в свои головы то, что потом им будет приносить пользу в долгую.
Хочу поблагодарить за ту поддержку, которая была оказана в течении всего курса. Это правда ценно.  Информация разбиралась до мельчайших деталей, не было просто абстрактной теории, только практические, живые примеры"
				/>
				<CardClient
					className="flex-grow"
					img="/client-2.png"
					name="Анна Шарипова"
					role="Product Designer, Design System"
					company="Банк Точка"
					content="В блоке дизайна понравилось и было полезно про разные подходы к организации и неймингу токенов, дало хорошую отправную точку по пониманию как это можно использовать под свои задачи и особенности проекта. Очень хорошее погружение в сторибук и работу с ним. Узнала как проводить ревью компонентов и какие подводные камни там могут быть

Спасибо Артуру за терпение и отличное погружение в сложные моменты разработки"
				/>
				<CardClient
					className="flex-grow"
					img="/client-3.png"
					name="Анна Скользнева"
					role="Senior Graphic Designer"
					company="ИнфоТеКС"
					content={`Очень понравилась наглядная демонстрация связки дизайна с кодом, это помогает в работе больше всего. Стало намного проще ориентироваться в пропсах компонентов и  собирать компоненты в дизайне более похожими на те, которые есть в коде. 
                    Материал был представлен доступно, порадовало, что можно задавать вопросы как по лекциям, так и по моментам, возникающим в работе. Спасибо за дополнительные материалы, которые ты для нас готовил)`}
				/>
			</div>
		</div>
	);
};
