"use client";

import { Box } from "./components/box/box";
import { HeroSection } from "./sections/hero.section";
import { ReadySection } from "./sections/ready.section";
import { Testimonials } from "./sections/testimonials";
import { Companies } from "./sections/companies";
import { MainPageSection } from "./sections/main-page.section";

const accordionData = [
	{
		title: "Почему именно этот курс?",
		content: `Курс на самом деле уникален. Он довольно непростой. В нем не будет монотонной начитки стандартных вещей которые можно найти в интернете. Так же не будет классической отрисовки UI-kit’a который будет подан как дизайн-система. В курсе вложен весь мой многолетний опыт работы с дизайн системами, практические выжимки задач и решений с которыми мне приходилось сталкиваться каждый день.
                Здесь мы не будем много рисовать но, будем много анализировать для того, чтобы понимать как правильно подходить к задаче и решать ее. Будем писать код, чтобы понимать и видеть мир дизайн систем глазами разработчика. Посмотрим на процесс сотрудником, которому нужно продать её важность в компании и, подумаем о дизайнере, который использует её каждый день. Также мы научимся разговаривать с разработкой на одном языке, не идти на поводу у технологий и понимать ограничения для того, чтобы грамотно строить и синхронизировать компоненты из дизайна в код`,
	},
	{
		title: "Я новичок в дизайн-системах, смогу потянуть?",
		content: `Буду честен, для абсолютных новичков, без опыта во фронте либо в использовании или создании дизайн библиотек это будет очень сложно но, если есть желание превозмочь себя и пересмотреть лекции N раз чтобы вкачаться то, добро пожаловать на борт`,
	},

	{
		title: "Что я получу по итогу?",
		content: `Настоящий трухард. Прочувствуете на себе работу по выстраиванию дизайн-системы на всех её этапах. Посмотрите на неё со стороны Дизайна, Разработки, Бизнеса. Разовьете не только хардовые ни и софтовые навыки так как в курсе есть своя изюминка которую я закладывал при его создании. Будет довольно сложно но, оно того стоит, поверьте.`,
	},
];

export default function Home() {
	return (
		<>
			<HeroSection
				heroImg="/qualifine.png"
				title="Qualifine"
				subTitle="Квинтэссенция знаний"
				description="Ускорьте свою карьеру или производительность команды, присоединившись к нашим уникальным курсам по Архитектуре дизайн-систем, продвинутым исследованиям 
пользовательского опыта и не только!"
			/>
			<Companies />
			<h2>Курсы</h2>
			<MainPageSection
				heroImg="/heroHouseSquare.png"
				actions
				lessons
				stream="8-й поток"
				date="10 Января 2026"
				timing="2.5 - 3"
				subTitle="Архитектор Дизайн-систем"
				description="Уникальный курс, не имеющий аналогов во всём мире, который вобрал в себя весь огромный, практический опыт работы с дизайн-системами, от истоков образования до
наших дней"
				linkToProgram="/dsarchitect"
			/>
			<MainPageSection
				heroImg="/researhcHeroSquare.png"
				actions
				lessons
				invert
				stream="3-й поток"
				date="TBD"
				timing="2 - 2.5"
				subTitle="Продвинутый Ресёрч"
				description="Окунись в мир пользовательских исследований на продвинутом урове. Только релевантные топики. Исследования, их виды и какой метод выбрать в каком случае. Проведение и анализ интервью. Использование ИИ. Защита и аргументация итогов перед командой"
				linkToProgram="/advancedresearch"
			/>
			<MainPageSection
				heroImg="/tech-course-cquare.png"
				actions
				lessons
				stream="1-й поток"
				date="TBD"
				timing="3 - 3.5"
				subTitle="AI [tech] дизайнер-разработчик"
				description="Хардкорный курс, который покрывает практически все аспекты дизайна и разработки плагинов для Figma, а также сборки компонентов разной сложности. Структурировано, выверено, осмысленно. Мы будем не просто писать забросы, а анализировать полученный код чтобы докручивать его до необходимого состояния"
				linkToProgram="/plugindeveloper"
			/>
			<Testimonials />

			<ReadySection
				title="Готов превратиться
в эксперта по цифровым продуктам?"
			/>
		</>
	);
}
