"use client";

import { Globals } from "@/app/theme/globals";

export default function Page() {
	return (
		<>
			<section className=" container display-flex flex-column">
				<div className="legal-docs section-shadow">
					<h3 className="mb-24">
						Оферта на заключение договора об оказании платных
						образовательных услуг (для юридических лиц)
					</h3>
					<p>
						Настоящий документ, постоянно размещенный в сети
						Интернет по сетевому адресу{" "}
						<a href="http://dsarchitect.ru/documents/forbusinnes">
							http://dsarchitect.ru/documents/forbusinnes
						</a>
						, является предложением Самозанятого Иванова Артура
						Викторовича (далее – Исполнитель) заключить Договор об
						оказании платных образовательных услуг по программам
						дополнительного обучения (далее – Договор) с любым
						заинтересованным юридическим лицом (далее – Заказчик) и
						указанными им физическими лицами (далее – Обучающийся).
						Настоящий документ является публичной офертой в
						соответствии с пунктом 2 статьи 437 Гражданского Кодекса
						Российской Федерации. Надлежащим акцептом настоящей
						Оферты в соответствии со статьей 438 Гражданского
						кодекса Российской Федерации считается осуществление
						Заказчиком и каждым Обучающимся в совокупности всех
						нижеперечисленных действий:
					</p>

					<ul className="display-flex flex-column gap-8">
						<li>
							* ознакомление Заказчика и Обучающегося с условиями
							Оферты;
						</li>
						<li>
							* выражение Заказчиком согласия с условиями Оферты
							путём оплаты счета
						</li>
						<li>
							* ознакомление Заказчика и Обучающегося с условиями
							Оферты;
						</li>
					</ul>
					<p className="mb-24">
						Датой акцепта Оферты Заказчиком и Обучающимся (датой
						заключения Договора) считается дата оплаты стоимости
						обучения по выбранной Программе.
					</p>
					<h5 className="mb-24">
						ДОГОВОР ОБ ОКАЗАНИИ ПЛАТНЫХ ОБРАЗОВАТЕЛЬНЫХ УСЛУГ
					</h5>
					<div className="display-flex flex-column gap-16 mb-32">
						<h6>1. Термины</h6>
						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Программа</p>
							<p>
								Дополнительная профессиональная программа, вид
								которой определяется на сайте Исполнителя,
								реализуемая с использованием дистанционных
								образовательных технологий
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Обучающийся</p>
							<p>
								Физическое лицо, осваивающее дополнительную
								профессиональную программу.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Сайт</p>
							<p>
								размещенный по адресу{" "}
								<a href="http://dsarchitect.ru">
									http://dsarchitect.ru
								</a>
								.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Закон</p>
							<p>
								Федеральный закон от 29 декабря 2012 г. № 273-ФЗ
								“Об образовании в Российской Федерации”.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Занятие</p>
							<ul className="display-flex flex-column gap-8">
								<li>
									* Лекция или семинар с прилагаемыми
									дополнительными материалами и практическими
									заданиями, проводимые с использованием
									дистанционных технологий (VK Звонки):
								</li>
								<li>
									* Вебинар — Занятие, транслируемое в режиме
									реального времени (онлайн). Для доступа к
									Занятию в формате вебинара Обучающийся
									подключается к Занятию в дату и время его
									проведения, указанную в чате потока.
									Обучающийся может участвовать в Занятии
									интерактивно, в том числе с возможностью
									задавать вопросы преподавателю/эксперту в
									режиме реального времени посредством чата
									или голосом.
								</li>
								<li>
									* Запись — записанные одно или несколько
									Занятий по определённой теме, которые
									доступны по ссылке в чате потока. Занятие в
									формате записи Обучающийся может освоить в
									любое время, запись доступна и после срока
									обучения.
								</li>
							</ul>
						</div>
						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Модуль, или Блок</p>
							<p>
								Совокупность Занятий, объединённых определённой
								тематикой в рамках одной Программы (далее —
								часть Программы).
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">
								Преподаватель, или Эксперт
							</p>
							<p>
								Физическое лицо, которое проводит Занятия и/или
								проверяет практические задания Обучающегося.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">
								Срок освоения Программы, или продолжительность
								обучения
							</p>
							<p>
								Программа делится на три Блока, общая
								продолжительность Программы двенадцать недель
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Период обучения</p>
							<p>
								Период обучения: начинается с даты первого
								Занятия, проводимого в формате вебинара, а
								завершается датой последнего Занятия.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Дата начала</p>
							<p>
								Дата начала программы: определяется Исполнителем
								и может сдвигаться не более чем на 14
								(четырнадцать) календарных дней. Дата начала
								программы указываете в счете на оплату.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">
								Документ о квалификации
							</p>
							<p>
								Документ о квалификации, выдаваемый Исполнителем
								Обучающемуся, успешно окончившему обучение по
								Программе: Именной сертификат об окончании
								Программы.
							</p>
						</div>

						<div className="display-flex flex-column gap-8">
							<p className="text-strong">Тариф</p>
							<p>
								Набор услуг, предоставляемых Исполнителем в ходе
								реализации Программы. Стоимость составляет
								пятьдесят тысяч рублей.
							</p>
						</div>
					</div>
					<div className="display-flex flex-column gap-16 mb-32">
						<h6>2. Предмет Договора</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								2.1. Исполнитель обязуется оказать в отношении
								Обучающихся, указанных Заказчиком,
								образовательные услуги по дополнительной
								образовательной программе. Заказчик обязуется
								принять и оплатить эти услуги, а каждый
								Обучающийся обязуется предпринять все зависящие
								от него действия, необходимые для прохождения и
								завершения обучения.
							</p>

							<p>
								2.2. Договор действует в отношении любой
								образовательной программы, которая:
							</p>

							<p>2.2.1. Размещена на Сайте и </p>

							<p>2.2.2. Указана в счете на оплату.</p>

							<p>
								2.3. Обучение проводится в онлайн формате в виде
								Занятий.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>3. Права Исполнителя, Заказчика и Обучающегося</h6>
						<div className="display-flex flex-column gap-8">
							<p className="text-strong">
								3.1. Исполнитель вправе:
							</p>
							<p>
								3.1.1. Изменить в одностороннем порядке период
								обучения без изменения продолжительности
								обучения не более чем на 14 (четырнадцать)
								календарных дней.
							</p>
							<p className="mb-8">
								3.1.2. Вносить изменения в учебный план,
								вызванные объективной необходимостью (например,
								в случае болезни Эксперта, технических проблем
								или для улучшения Программы).
							</p>
							<p className="text-strong">3.2. Заказчик вправе:</p>
							<p>
								3.2.1. Получать информацию от Исполнителя по
								вопросам организации и обеспечения надлежащего
								предоставления услуг, предусмотренных Договором.
							</p>
							<p className="mb-8">
								3.2.2. Получить возврат денежных средств до
								начала оказания услуг или в течение 14
								(четырнадцати) календарных дней с момента начала
								обучения по Программе в соответствии с Датой
								начала указанной в счете. Заказчик обязан
								письменно уведомить Исполнителя об отказе от
								получения услуг.
							</p>
							<p className="text-strong">
								3.3. Обучающийся вправе:
							</p>
							<p>
								3.3.1. Сохранить бессрочный доступ ко всем
								материалам Исполнителя с момента их получения.
								Заказчик согласен с тем, что если онлайн
								платформы на которых будут располагаться
								материалы прекратят свою деятельность,
								Исполнитель не несет никакой ответственности за
								их сохранность. При этом Стороны особо
								оговаривают, что проверка заданий, выполняемых
								Заказчиком, а также ответы и консультации
								Исполнителя возможны только в течение обучения
								по Программе, и не предоставляются после
								окончания Программы.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>
							4. Обязанности Исполнителя, Заказчика и Обучающегося
						</h6>
						<div className="display-flex flex-column gap-8">
							<p className="text-strong">
								4.1. Исполнитель обязан:
							</p>
							<p>
								4.1.1. Обеспечить Обучающемуся условия для
								освоения Программы, в том числе предоставить
								зарегистрированным Обучающимся доступ к
								материалам Программы.
							</p>
							<p>
								4.1.3. Довести до Заказчика и Обучающегося
								сведения о порядке предоставления
								образовательных услуг.
							</p>
							<p>
								4.1.4. Организовать и обеспечить надлежащее
								оказание образовательных услуг в соответствии с
								учебным планом и расписанием занятий
								Исполнителя.
							</p>
							<p className="mb-8">
								4.1.5. Выдать Обучающемуся: Именной сертификат
								об успешном прохождении Программы.
							</p>
							<p className="text-strong">4.2. Заказчик обязан:</p>
							<p>
								4.2.1. Своевременно внести плату за
								предоставляемые Обучающемуся образовательные
								услуги в порядке, установленном в разделе 5
								Договора.
							</p>
							<p className="mb-8">
								4.2.2. Ознакомиться с содержанием Программы{" "}
								<a href="https://www.figma.com/proto/vzVCZoKjuAbHN4xikNlKOB/DSA-%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0?page-id=0%3A1&type=design&node-id=7-2&viewport=377%2C569%2C0.77&t=NthAa9nPknj8ivZo-1&scaling=min-zoom&starting-point-node-id=7%3A2&mode=design">
									Ссылка
								</a>
							</p>
							<p className="text-strong">
								4.3. Обучающийся обязан :
							</p>
							<p>
								4.3.1. Ознакомиться с содержанием Программы{" "}
								<a href="https://www.figma.com/proto/vzVCZoKjuAbHN4xikNlKOB/DSA-%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0?page-id=0%3A1&type=design&node-id=7-2&viewport=377%2C569%2C0.77&t=NthAa9nPknj8ivZo-1&scaling=min-zoom&starting-point-node-id=7%3A2&mode=design">
									Ссылка
								</a>
							</p>
							<p className="mb-8">
								4.3.2. Осваивать Программу и выполнять в
								установленные сроки практические задания,
								предусмотренным Программой. При этом Обучающийся
								обязуется выполнять практические задания
								надлежащим образом, без плагиата, а в случае
								указания Эксперта дорабатывать свое решение.
							</p>
							<p className="text-strong">
								4.4. Исполнитель не несет ответственности за:
							</p>
							<p>
								4.4.1. Не ознакомление Обучаещегося с
								материалами, непосещение Занятий,
								предусмотренных в Программе, по неуважительным
								причинам и без письменного уведомления.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>5. Финансовые условия</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								5.1. Заказчик обязан произвести оплату в полном
								объеме в течение 7 (семи) рабочих дней со дня
								выставления счета.
							</p>

							<p>
								5.2. Оплата производится в безналичном порядке
								по реквизитам, указанным в разделе 10 Договора.
							</p>

							<p>
								5.4. Обязанность по оплате услуг по настоящему
								Договору считается исполненной Заказчиком с даты
								списания полной суммы денежных средств с
								корреспондентского счета банка Заказчика.
							</p>

							<p>
								5.5. Факт оказания услуг подтверждается
								Универсальным передаточным документом (далее –
								УПД). Исполнитель направляет УПД в течение 5
								(пяти) рабочих дней с даты окончания периода
								обучения по Договору, а оригинал УПД – в течение
								10 (десяти) рабочих дней с даты окончания
								периода обучения по Договору. Стороны
								установили, что услуги считаются оказанными
								надлежащим образом и принятыми Заказчиком, если
								в течение 5 (пяти) рабочих дней с момента
								направления оригинала УПД Заказчику, от
								Заказчика не получены мотивированные письменные
								возражения. По истечении 5 (пяти) рабочих дней с
								момента направления оригинала УПД Заказчику
								любые претензии, в том числе по количеству
								(объему) и качеству Услуг, не принимаются. В
								случае предоставления Заказчиком мотивированных
								возражений, Стороны в рабочем порядке в течение
								10 (десяти) рабочих дней составляют Протокол
								разногласий, содержащий по каждому замечанию
								принятое решение об обоснованности, сроке и
								условиях их устранения Исполнителем.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>6. Интеллектуальная собственность</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								6.1. В рамках обучения на Программе Обучающемуся
								предоставляется доступ к интеллектуальной
								собственности Исполнителя (доступ к сетевым
								информационным ресурсам, учебным и
								учебно-методических материалам, не находящимся в
								открытом доступе), в связи с чем Обучающийся
								обязан:
							</p>
							<p>
								* воздерживаться от любых действий, которые
								нарушают права Исполнителя на результаты
								интеллектуальной деятельности, в частности, не
								копировать, не записывать, не воспроизводить, не
								распространять любые результаты интеллектуальной
								деятельности Исполнителя без письменного
								разрешения Исполнителя;
							</p>
							<p className="mb-8">
								* немедленно сообщать Исполнителю о любых
								ставших известными фактах нарушения
								исключительных прав Исполнителя;
							</p>
							<p>
								6.2. В ходе обучения на Программе Обучающийся
								создает материалы, являющиеся интеллектуальной
								собственностью Обучающегося: итоговая работа (в
								текстовой, графической, аудиовизуальной форме),
								практические задания, а также иные материалы
								(далее – материалы).
							</p>
							<p>
								6.3. Обучающийся на безвозмездной основе
								предоставляет Исполнителю право использования
								материалов, созданных Обучающимся в ходе
								обучения на Программе, на условиях простой
								(неисключительной) лицензии на территории всего
								мира и сроком на 5 лет следующими способами:
							</p>
							<p>
								* распространение, воспроизведение материалов
								как полностью, так и любых их фрагментов, в том
								числе путем размещения на Сайте;
							</p>
							<p>* переработка материалов</p>
							<p className="mb-8">
								* доведение материалов до всеобщего сведения.
							</p>
							<p>
								6.4. Если в ходе обучения Обучающийся будет
								создавать материалы, в основу которых положена
								конфиденциальная информация, относящаяся к
								деятельности Заказчика, Обучающийся и Заказчик
								обязаны оповестить об этом Исполнителя до начала
								обучения. В таком случае Исполнитель, получивший
								такую конфиденциальную информацию, обязуется не
								разглашать ее третьим лицам и не использовать
								любым другим образом, кроме как для оказания
								услуг по Договору.
							</p>
							<p>
								6.5. Право использования материалов переходит к
								Исполнителю в момент их передачи в электронном
								виде в любом общепринятом расширении на
								электронную почту hello@dsarchitect.ru ,
								artur.dsgn@yandex.ru, в том числе посредством
								предоставления ссылки на файлообменный ресурс
								или иной онлайн доступ. Исполнитель не обязан
								предоставлять Обучающемуся отчеты об
								использовании материалов.
							</p>

							<p>
								6.6. Авторские права, в том числе исключительное
								право, на полученные в ходе выполнения
								практических заданий и подготовки итоговой
								работы результаты принадлежат Обучающемуся.
							</p>
							<p>
								6.7. Обучающийся гарантирует, что обладает
								достаточными правами для выполнения
								обязательства, предусмотренного пунктом 6.3.
								Договора, и в случае, если для создания
								материалов привлекались третьи лица, Обучающийся
								заключил с такими лицами соответствующие
								договоры, условия которых позволяют Обучающемуся
								пользоваться данными материалами без обременений
								и ограничений, в том числе использовать их без
								указания информации об авторе.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>
							7. Срок действия договора. Порядок изменения и
							расторжения договора
						</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								7.1. Договор действует с даты его заключения и
								до даты окончания Периода обучения, а в части
								денежных обязательств – до полного их исполнения
								Сторонами.
							</p>
							<p>
								7.2. Договор может быть расторгнут по соглашению
								Сторон.
							</p>
							<p>
								7.3. Обучающийся вправе в любое время
								расторгнуть договор путем направления
								Исполнителю заявления об отчислении. Заявление
								об отчислении направляется по адресу электронной
								почты, указанному в разделе 10 Договора, или{" "}
								<a href="mailto:hello@dsarchitect.ru">
									hello@dsarchitect.ru
								</a>{" "}
								,{" "}
								<a href="mailto:artur.dsgn@yandex.ru">
									artur.dsgn@yandex.ru
								</a>
								.
							</p>
							<p>
								7.4. Заказчик вправе в любое время расторгнуть
								Договор при условии уведомления Исполнителя за
								10 (десять) рабочих дней до предполагаемой даты
								расторжения. Уведомление направляется по адресу
								электронной почты, указанному в разделе 10
								Договора.
							</p>
							<p>
								7.5. Действие Договора прекращается досрочно по
								обстоятельствам, не зависящим от воли
								Обучающегося и Исполнителя.
							</p>
							<p>
								7.6. В случае досрочного расторжения Договора
								сроком превышающим указанный в п 3.2.2
								Исполнитель не возвращает Заказчику сумму
								стоимости обучения.
							</p>
							<p>
								7.7. Договор считается расторгнутым с момента
								обоюдного согласования даты между Заказчиком и
								Исполнителем.
							</p>
							<p>
								7.8. Если какие-то части материалов, Занятий,
								Модулей обучения могут не соответствовать
								ожиданиям Заказчика, субъективная оценка
								Заказчика не может являться объективным
								критерием качества и возврата денег за обучение.
								При оплате счета Заказчик соглашается с
								условиями договора и тем что он выполнил пункт
								4.2.2
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>8. Ответственность Сторон</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								8.1. При неисполнении Обучающимся обязательства,
								предусмотренного пунктами 6.1 Договора, и
								выявлении Исполнителем факта доступа третьих лиц
								к содержанию Программы Обучающийся обязан во
								внесудебном порядке по письменному требованию
								Исполнителя оплатить штраф в размере 100 000
								(сто тысяч) рублей.
							</p>
							<p>
								8.2. В случае нарушения Заказчиком указанного в
								пункте 5.2 Договора срока оплаты оказанных
								услуг, Обучающийся не будет допущен к Занятиям и
								учебным материалам.
							</p>
							<p>
								8.3. Изменение сроков оказания образовательных
								услуг в соответствии с пунктом 3.1.1, 3.1.2
								Договора не является нарушением Исполнителем
								обязательств.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>9. Заключительные положения</h6>
						<div className="display-flex flex-column gap-8">
							<p>
								9.1. Стороны договорились, что если иное прямо
								не предусмотрено законодательством или настоящим
								Договором, любые сообщения, уведомления и
								документы в виде хорошо читаемых скан- или
								фотокопий, направленных Сторонами исключительно
								с электронных адресов: Исполнителя – с адреса
								электронной почты{" "}
								<a href="mailto:hello@dsarchitect.ru">
									hello@dsarchitect.ru
								</a>{" "}
								,{" "}
								<a href="mailto:artur.dsgn@yandex.ru">
									artur.dsgn@yandex.ru
								</a>{" "}
								, Заказчика и Обучающихся — с личных или рабочих
								адресов электронной почты обладают юридической
								силой соответствующих документов на бумажном
								носителе и создают для Сторон все права и
								обязанности, предусмотренные настоящим
								Договором.
							</p>
							<p>
								9.2. Стороны гарантируют работоспособность
								указанных в Договоре адресов электронной почты и
								самостоятельно несут риски, связанные с
								неполучением, несвоевременным получением или
								отправкой сообщений, неознакомлением с их
								содержанием в связи с любыми техническими
								неисправностями в работе электронной почты,
								отсутствием доступа к ней по любым причинам,
								включая отсутствие доступа в Интернет,
								результатами специальной сортировки сообщений, в
								частности, попаданием сообщений в папку «Спам»
								либо аналогичную.
							</p>
							<p>
								9.3. В случае изменения наименования,
								местонахождения или банковских реквизитов любой
								Стороны она обязана уведомить об этом другую
								Сторону не менее чем за 3 (три) рабочих дня со
								дня наступления указанных обстоятельств любыми
								доступными способами, позволяющими подтвердить
								получение такого уведомления другой Стороной.
								Любые убытки, возникшие у Стороны, не
								исполнившей и/или несвоевременно исполнившей
								обязательство по уведомлению, связанные с
								отсутствием такого уведомления, не подлежат
								компенсации другой Стороной.
							</p>
							<p>
								9.4. Все споры, разногласия и претензии, которые
								могут возникнуть в связи с исполнением,
								расторжением или признанием недействительным
								Договора, Стороны будут стремиться решить путем
								переговоров в следующем порядке:
							</p>
							<p>
								9.4.1. Сторона, у которой возникли претензии
								и/или разногласия, направляет другой Стороне на
								электронную почту сообщение с указанием
								возникших претензий и/или разногласий. Сообщение
								должно содержать суть предъявляемого требования
								и доказательства, подтверждающие требование.
								Исполнитель направляет сообщение на адрес
								электронной почты Заказчика, указанный в разделе
								10 Договора, и/или на адреса электронных почт
								Обучающихся.
							</p>
							<p>
								9.4.2. Сторона, получившая претензию, должна
								дать письменный ответ по существу заявленных в
								претензии требований не позднее 10 (десяти)
								рабочих дней с даты получения претензии.
								Оставление претензии без ответа при наличии
								подтверждения получения претензии Стороной
								означает безусловное признание заявленных в
								претензии требований.
							</p>
							<p>
								9.4.3. Все споры, возникающие из Договора,
								разрешаются на основании законодательства
								Российской Федерации. Все споры и разногласия
								между Заказчиком и Исполнителем, не разрешенные
								в досудебном порядке, передаются на рассмотрение
								Арбитражного суда г. Москвы.
							</p>
						</div>
					</div>

					<div className="display-flex flex-column gap-16 mb-32">
						<h6>10. Реквизиты </h6>
						<div className="display-flex flex-column gap-8">
							<p>Самозанятый Иванов Артур Викторович</p>
							<p>
								Адрес: 125635, Россия, г. Москва, улица Дыбенко,
								д 7/1, квартира 1090{" "}
							</p>
							<p>
								Email:{" "}
								<a href="mailto:hello@dsarchitect.ru">
									hello@dsarchitect.ru
								</a>{" "}
								,{" "}
								<a href="mailto:artur.dsgn@yandex.ru">
									artur.dsgn@yandex.ru
								</a>{" "}
							</p>
							<p>
								Телефон:{" "}
								<a href="tel:+79622637027">+7 962 263 70 27</a>
							</p>
						</div>
					</div>
				</div>
			</section>
		</>
	);
}
